---
kind: method
id: M:Autodesk.Revit.DB.TransformWithBoundary.#ctor(Autodesk.Revit.DB.TransformWithBoundary)
source: html/2cddb515-353f-5d9b-3086-a46c1b6ef4aa.htm
---
# Autodesk.Revit.DB.TransformWithBoundary.#ctor Method

Constructs a new copy of the input TransformWithBoundary object.

## Syntax (C#)
```csharp
public TransformWithBoundary(
	TransformWithBoundary other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.TransformWithBoundary`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null